app/Http/Controllers/AdminCategoryController.php

SELECT * FROM `categories`
---
    public function index()
    {

        return view('dashboard.categories.index', [
            'categories' => Category::all()
        ]);

SELECT * FROM `categories`
---
    public function create()
    {
        return view('dashboard.categories.create', [
            'categories' => Category::all()
        ]);

INSERT INTO `categories` (`name`, `slug`, `updated_at`, `created_at`) VALUES ('Haloooo', 'haloooo', '2024-02-18 08:38:14', '2024-02-18 08:38:14')
---
    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'name' => 'required|max:255|min:2',
            'slug' => 'required|unique:categories,slug'
        ]);

        $validatedData['name'] = ucwords($validatedData['name']);
        $validatedData['slug'] = Str::slug($validatedData['name']);

        Category::create($validatedData);

SELECT * FROM `categories`
---
    public function edit(Category $category)
    {
        return view('dashboard.categories.edit', [
            'category' => $category,
            'categories' => Category::all()

UPDATE `categories` SET `name` = 'UX Design', `categories`.`updated_at` = '2024-02-18 08:52:42' WHERE `id` = 12
---
    public function update(Request $request, Category $category)
    {
        // Atur aturan validasi
        $rules = [
            'name' => 'required|max:255|min:2',
        ];

        // Jika perubahan slug, tambahkan aturan validasi untuk slug
        if ($request->slug != $category->slug) {
            $rules['slug'] = 'required|unique:posts';
        }

        // Validasi data menggunakan aturan yang telah ditetapkan
        $validatedData = $request->validate($rules);

        // Perbarui data post yang ada di database
        Category::where('id', $category->id)->update($validatedData);

DELETE FROM `categories` WHERE `id` = 14
SELECT * FROM `categories` WHERE `id` in (14)
---
    public function destroy(Category $category)
    {
        Category::destroy($category->id);
        return redirect('/dashboard/categories')->with('success', 'Category has been deleted!');