app/Http/Controllers/DashboardPostController.php

    public function index()
    {
       return view('dashboard.posts.index', [
            'posts' => Post::where('user_id', auth()->user()->id)->get()
       ]);
---
SELECT * FROM `posts` WHERE `user_id` = 6

    public function edit(Post $post)
    {
        return view('dashboard.posts.edit', [
            'post' => $post,
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`

        $validatedData['user_id'] = auth()->user()->id;

        // Perbarui data post yang ada di database
        Post::where('id', $post->id)->update($validatedData);
---
UPDATE `posts` SET `title` = 'brokok', `category_id` = '1', `body` = '<div><em>wddddddddddddddddddddddddddddddd<br></em><br></div><h1><strong><del>Apala we</del></strong></h1>', `user_id` = 6, `excerpt` = 'wdddddddddddddddddddddddddddddddApala we', `posts`.`updated_at` = '2024-02-17 09:43:38' WHERE `id` = 22