app/Http/Controllers/HomeController.php

    public function index(Request $request)
    {
        $categories = Category::all();

        if (request('category')) {
            $category = Category::firstWhere('slug', request('category'));
            $title = 'Category: ' . $category->name;
        }

        // Menggunakan query Post dengan eager loading untuk 'category'
        $posts = Post::with(['category'])->latest()->filter($request->only(['search']))->get();
---
SELECT * FROM `categories`
SELECT * FROM `posts`