app/Http/Controllers/PostController.php

    public function index()
    {
        $posts = Post::all();
---
SELECT * FROM `posts`